src/cf/InformationRegisters/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыЗаказов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбновитьСтатусЗаказа(Заказ, Статус, ДатаСтатуса = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Период = ?(ДатаСтатуса = Неопределено, ТекущаяДатаСеанса(), ДатаСтатуса);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция АктуальныйСтатусЗаказа(Заказ, Период = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗаказовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыЗаказов.СрезПоследних(&Период, Заказ = &Заказ) КАК СтатусыЗаказовСрезПоследних";
	
	Если Период = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтатусЗаказа = Выборка.Статус;
	КонецЕсли;
	
	Возврат СтатусЗаказа;
	
КонецФункции

#КонецОбласти

#КонецЕсли
